In [23]:
import pandas as pd

In [24]:
data = [
    [15,254,3],
    [475,5,6000],
    [7654,82015,988]
]

data

[[15, 254, 3], [475, 5, 6000], [7654, 82015, 988]]

In [25]:
list('321')

['3', '2', '1']

In [26]:
df = pd.DataFrame(data, index=list('321'), columns=list('CBA'))
df

      C      B     A
3    15    254     3
2   475      5  6000
1  7654  82015   988

In [27]:
df.sort_index(inplace = True)
df

      C      B     A
1  7654  82015   988
2   475      5  6000
3    15    254     3

In [28]:
df.sort_index(axis = 1, inplace = True)
df

      A      B     C
1   988  82015  7654
2  6000      5   475
3     3    254    15

In [29]:
df.sort_values(by = 'A', inplace=True)
df

      A      B     C
3     3    254    15
1   988  82015  7654
2  6000      5   475

In [30]:
df.sort_values(by = '3', axis = 1, inplace=True)
df

      A     C      B
3     3    15    254
1   988  7654  82015
2  6000   475      5

In [50]:
df.sort_values(by = ['B', 'A'], inplace=True)
df

       B     C     A
2      5   475  6000
3    254    15     3
1  82015  7654   988

In [52]:
df.sort_values(by = ['B', 'C'], inplace=True)
df

       B     C     A
2      5   475  6000
3    254    15     3
1  82015  7654   988

In [46]:
df.sort_values(by = '2', axis = 1, inplace=True)
df

       B     C     A
3    254    15     3
1  82015  7654   988
2      5   475  6000